---
type: ColorWithTransparency
namespace: Autodesk.Revit.DB
version: 2024
members: 14
tags: [revit-api, class]
---

# ColorWithTransparency

`Autodesk.Revit.DB.ColorWithTransparency` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ColorWithTransparency | — | `` |
| Constructor | ColorWithTransparency | 2017 | `public ColorWithTransparency ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBlue | 2017 | `public uint GetBlue ()` |
| Method | GetColor | 2017 | `public Color GetColor ()` |
| Method | GetGreen | 2017 | `public uint GetGreen ()` |
| Method | GetRed | 2017 | `public uint GetRed ()` |
| Method | GetTransparency | 2017 | `public uint GetTransparency ()` |
| Method | SetBlue | 2017 | `public void SetBlue ( uint blue )` |
| Method | SetColor | 2017 | `public void SetColor ( Color color )` |
| Method | SetGreen | 2017 | `public void SetGreen ( uint green )` |
| Method | SetRed | 2017 | `public void SetRed ( uint red )` |
| Method | SetTransparency | 2017 | `public void SetTransparency ( uint transparency )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |